Revit 2021.1 API
CorrectionFactor Members
The CorrectionFactor type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Factor
 Get factor value of wire correction factor.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Temperature
 Get temperature which is used for specifying correction factor.
See Also
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace